app/controllers/api/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    @movies = Movie.search(params[:name])

INSERT INTO "movies" ("name", "year", "synopsis", "director", "grade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save